#+TAGS: @home @office @calendar @Trash @memo @life @work @summary @blog @c++ @python @arithmetic @redis @mongodb @mysql @c @java @scala @hadoop @R @spark @machine_learning @octopress @learn

**** TODO Noon_break_time                                                       :@life:@calendar:
     SCHEDULED: <2015-07-14 Tue 12:00-14:00 +1d>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:48]
     - State "done"       from "TODO"       [2015-07-09 Thu 14:16]
     - State "done"       from "STARTED"    [2015-07-09 Thu 14:02]
    :LOGBOOK:
    CLOCK: [2015-07-09 Thu 13:32]--[2015-07-09 Thu 14:02] =>  0:30
    :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Reading_time                                                          :@home:@calendar:@learn:
     SCHEDULED: <2015-07-22 Wed 18:00-21:00 +1w>
     - State "done"       from "TODO"       [2015-07-08 Wed 20:34]
     - State "done"       from "TODO"       [2015-07-08 Wed 20:33]
     :LOGBOOK:
     CLOCK: [2015-07-08 Wed 19:11]--[2015-07-08 Wed 20:32] =>  1:21
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-08 Wed 20:34]
     :END:
**** TODO Reading_time
     SCHEDULED: <2015-08-07 Fri 18:00-21:00 +1w>
     - State "DONE"       from "TODO"       [2015-07-10 Fri 23:47]
     - State "DONE"       from "TODO"       [2015-07-10 Fri 21:31]
     - State "DONE"       from "TODO"       [2015-07-10 Fri 21:29]
     - State "DONE"       from "STARTED"    [2015-07-10 Fri 21:29]
     :LOGBOOK:
     CLOCK: [2015-07-10 Fri 18:07]--[2015-07-10 Fri 21:29] =>  3:22
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-10 Fri 23:47]
     :END:
**** TODO Coding_time
     SCHEDULED: <2015-08-20 Thu 18:00-21:00 +1w>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:12]
     - State "done"       from "TODO"       [2015-07-09 Thu 21:23]
     - State "done"       from "TODO"       [2015-07-09 Thu 20:50]
     - State "done"       from "STARTED"    [2015-07-09 Thu 20:50]
     :LOGBOOK:
     CLOCK: [2015-07-09 Thu 18:07]--[2015-07-09 Thu 20:50] =>  2:43
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Writing_time
     SCHEDULED: <2015-08-13 Thu 21:00-22:30 +1w>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:12]
     - State "done"       from "TODO"       [2015-07-09 Thu 21:23]
     - State "done"       from "STARTED"    [2015-07-09 Thu 21:23]
     :LOGBOOK:
     CLOCK: [2015-07-09 Thu 20:57]--[2015-07-09 Thu 21:23] =>  0:26
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Writing_time
     SCHEDULED: <2015-08-15 Sat 21:00-22:30 +1w>
     - State "DONE"       from "TODO"       [2015-07-11 Sat 22:46]
     - State "DONE"       from "TODO"       [2015-07-11 Sat 22:46]
     - State "DONE"       from "TODO"       [2015-07-11 Sat 22:46]
     - State "DONE"       from "STARTED"    [2015-07-11 Sat 22:33]
     :LOGBOOK:
     CLOCK: [2015-07-11 Sat 21:04]--[2015-07-11 Sat 22:32] =>  1:28
     :END:
     - State "DONE"       from "TODO"       [2015-07-11 Sat 20:59]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-11 Sat 22:46]
     :END:
**** TODO Writing_time
     SCHEDULED: <2015-08-14 Fri 16:00-17:30 +1w>
     - State "DONE"       from "TODO"       [2015-07-10 Fri 23:47]
     - State "DONE"       from "TODO"       [2015-07-10 Fri 21:31]
     - State "DONE"       from "TODO"       [2015-07-10 Fri 21:29]
     - State "DONE"       from "STARTED"    [2015-07-10 Fri 18:06]
     :LOGBOOK:
     CLOCK: [2015-07-10 Fri 16:00]--[2015-07-10 Fri 18:00] =>  2:00
     :END:
     - State "DONE"       from "TODO"       [2015-07-10 Fri 18:02]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-10 Fri 23:47]
     :END:
**** TODO Study_time
     SCHEDULED: <2015-08-15 Sat 14:00-17:30 +1w>
     - State "DONE"       from "TODO"       [2015-07-11 Sat 22:46]
     - State "DONE"       from "TODO"       [2015-07-11 Sat 22:46]
     - State "DONE"       from "TODO"       [2015-07-11 Sat 22:33]
     - State "DONE"       from "TODO"       [2015-07-11 Sat 18:14]
     - State "DONE"       from "STARTED"    [2015-07-11 Sat 18:14]
     :LOGBOOK:
     CLOCK: [2015-07-11 Sat 16:33]--[2015-07-11 Sat 18:14] =>  1:41
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-11 Sat 22:46]
     :END:
***** WAITING python flask
      DEADLINE: <2015-07-10 Fri>
      - State "STARTED"    from "done"       [2015-07-09 Thu 11:31]
      - State "done"       from "STARTED"    [2015-07-09 Thu 11:30]
      :LOGBOOK:
      CLOCK: [2015-07-09 Thu 14:17]--[2015-07-09 Thu 16:32] =>  2:15
      CLOCK: [2015-07-09 Thu 09:32]--[2015-07-09 Thu 11:45] =>  2:13
      :END:
